#pragma once //≈сли подключить и эту директиву и ifndef то будет еще лучше
#include <iostream>
// вместо програм анц можно использовать

#ifndef _MYCLASS_H_ //если не определено им€ _MYCLASS_H_ то мы выполн€ем код, который 
//находитс€ до #endif
// #ifndef - переводитс€ как (if not defined) - если не определено им€ _MYCLASS_H_

#define _MYCLASS_H_ // определ€ем это им€

//ѕровер€ем было ли где-то в коде определено им€ _MYCLASS_H_ если нет то определ€ет его с помощью функции #define
// и добавл€ем весь код

namespace MyNamespace {

	class MyClass
	{
	public:
		void printMassage(char str[]);
	};




#endif // !1



//ƒл€ того чтобы в одном проекте использовать несколько классов с одним и также именем
//—оздадим собственное пространство имен и оборачиваем им наш класс и его реализацию


}

